Tekla Open API Reference for Tekla Structures 2025
DistanceList Structure
 A list of Distance instances.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
[TypeConverterAttribute(typeof(DistanceListConverter))]
public struct DistanceList : IXmlSerializable,
	IList<Distance>, ICollection<Distance>, IEnumerable<Distance>,
	IEnumerable, IFormattable
<SerializableAttribute>
<TypeConverterAttribute(GetType(DistanceListConverter))>
Public Structure DistanceList
	Implements IXmlSerializable, IList(Of Distance),
	ICollection(Of Distance), IEnumerable(Of Distance), IEnumerable,
	IFormattable
The DistanceList type exposes the following members.
Constructors
Name | Description
DistanceList
 Initializes a new instance of the structure.
Top
Properties
Name | Description
Count
 Gets the number of items in the list.
IsReadOnly
 Gets a boolean value indicating whether the collection is read-only.
Item
 Gets or sets the item at the specified index.
Top
Methods
Name | Description
Add
 Adds the specified item at the end of the list.
Clear
 Clears the list.
Contains
 Determines whether the specified item is in the list.
CopyTo
 Copies the contents of the list to an array.
GetEnumerator
 Gets an enumerator for enumeraring through the list.
IndexOf
 Returns the index of the first matching item in the list.
Insert
 Inserts an item at the specified position.
Parse(String)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider, Distance.UnitType)
 Parses a distance list from a string representation.
Remove
 Removes the specified item.
RemoveAt
 Removes an item at the specified position.
ToArray
 Copies the contents of the list into a new array.
ToString()
 Returns the string representation of the distance list.
 (Overrides ValueType.ToString().)
ToString(IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider, Distance.UnitType)
 Returns the string representation of the distance list.
Top
Remarks
DistanceLists are used to store related Distance instances in an enumerable, formattable list.
See Also
Reference
Tekla.Structures.Datatype Namespace